Repository: WordPressBugBounty/plugins-login-ip-country-restriction
Catalog: login-ip-country-restriction/langs/slicr-*.po
Languages: ro_ro

source: This plugin hooks in the authenticate filter. By default, the plugin is set to allow all access and you can configure the plugin to allow the login only from some specified IPs or the specified countries. PLEASE MAKE SURE THAT YOU CONFIGURE THE PLUGIN TO ALLOW YOUR OWN ACCESS. If you set a restriction by IP, then you have to add your own IP (if you are using the plugin in a local setup the IP is 127.0.0.1 or ::1, this is added in your list by default). If you set a restriction by country, then you have to select from the list of countries at least your country. The both types of restrictions work independent, so you can set only one type of restriction or both if you want.
ro_ro: Acest modul se agață de filtrul de autentificare. În mod implicit, acest modul este setat să permită autentificarea tuturor și poate fi configurat să permită autentificarea doar de la anumite IP-uri sau din anumite țări. TE ROG SĂ TE ASIGURI CĂ ÎȚI PERMIȚI PROPRIUL ACCESS CÂND CONFIGUREZI MODULUL. Dacă setezi o restricție pe IP, va trebui să adaugi IP-ul tău (dacă folosești modulul într-un mediu local, IP-ul 127.0.0.1 sau ::1 este adăugat automat în listă). Dacă setezi o restricție după țară, va trebui să selectezi din listă cel puțin țara ta. Cele două tipuri de restricții funcționează independent, așadar poți seta un tip de restricție sau pe ambele dacă dorești.

source: No country restriction
ro_ro: Nicio restricție pentru țări

source: Setup country restriction
ro_ro: Inițializează restricțiile pentru țări

source: Allow or block only the selected countries
ro_ro: Permite sau blochează numai țările selectate

source: Allowed countries
ro_ro: Țări permise

source: This is the list of countries from where the login is allowed.
ro_ro: Aceasta este lista de țări de unde este permisă autentificarea.

source: %1$s selected
ro_ro: %1$s selectate

source: you did not select any country yet
ro_ro: nu ai selectat nicio țară până acum

source: Blocked countries
ro_ro: Țări blocate

source: This is the list of countries from where the login is blocked.
ro_ro: Aceasta este lista cu țările pentru care autentificarea este blocată.

source: Countries list
ro_ro: Listă cu țări

source: Export Settings
ro_ro: Exportă setările

source: Here are some details about the current settings of this plugin, these can be reset or exported into another instance.
ro_ro: Aici sunt câteva detalii despre setările curente ale acestui modul, ele pot fi resetate sau exportate într-o altă instanță.

source: Reset to default
ro_ro: Resetează la valorile implicite

source: Please note that reset to default is not requiring for a confirmation, so be careful with clicking this button.
ro_ro: Te rog să reții că resetarea la valorile implicite nu necesită o confirmare, deci fii atent când dai clic pe acest buton.

source: Import Settings
ro_ro: Importă setările

source: Paste here the settings you want to import from another instance. This is a string in JSON format.
ro_ro: Plasează aici setările pe care vrei să le imporți din altă instanță. Este un șir de caractere în format JSON.

source: Paste here the JSON code.
ro_ro: Plasează aici codul JSON.

source: When you click the import button, the current settings will be replaced.
ro_ro: Când dai clic pe butonul Importă, setările curente vor fi înlocuite.

source: Debug
ro_ro: Depanare

source: Your current IP is %1$s and the country code is %2$s.
ro_ro: IP-ul tău curent este %1$s și codul de țară este %2$s.

source: The available detection method is %1$s.
ro_ro: Metoda de detecție disponibilă este %1$s.

source: Status/Debug
ro_ro: Stare/depanare

source: Here are some details about your current WordPress instance and the services versions that run currently in this environment.
ro_ro: Aici sunt câteva detalii despre instanța curentă de WordPress și versiunile serviciilor care rulează în acest mediu.

source: Test country code for IP
ro_ro: Testează codul de țară pentru IP

source: Test
ro_ro: Testează

source: The country code detected for the IP %1$s is %2$s. The detection was done through the %3$s method.
ro_ro: Codul țării detectate pentru IP-ul %1$s este %2$s. Detectarea s-a realizat prin metoda %3$s.

source: The %s function is part of the PHP service used on your server, and this is used as the default detection method. If this does not return the expected country code for the test IP, then you can try to bypass it and allow for other detection methods to run.
ro_ro: Funcția %s este parte a serviciului PHP care rulează pe serverul tău și este folosită ca metodă implicită de detecție. Dacă nu returnează codul de țară așteptat pentru IP-ul de testare, poți să încerci să o omiți și să permiți rularea altor metode de detecție.

source: Bypass the PHP %s function
ro_ro: Omite funcția PHP %s

source: Enable the PHP %s function
ro_ro: Activează funcția PHP %s

source: No IP restriction
ro_ro: Nicio restricție după IP

source: Setup IP restriction
ro_ro: Inițializează restricția după IP

source: Allow or block only specific IPs
ro_ro: Permite sau blochează numai anumite IP-uri

source: Allow specific IPs
ro_ro: Permite anumite IP-uri

source: Separate the IPs with comma if there are more.
ro_ro: Dacă sunt mai multe, separă IP-urile cu virgule.

source: For IP ranges, use ~ (ex: 192.168.0.~).
ro_ro: Pentru intervale de IP-uri, folosește ~ (de exemplu, 192.168.0.~).

source: * means any IP, you must remove it from the list if you want to apply a restriction.
ro_ro: * înseamnă orice IP, trebuie să îl înlături din listă dacă vrei să aplici o restricție.

source: Danger zone
ro_ro: Zonă periculoasă

source: remove the 127.0.0.1 and ::1 from the allowed IPs
ro_ro: înlătură 127.0.0.1 și ::1 din lista de IP-uri permise

source: include the server forward IP (HTTP_X_FORWARDED_FOR)
ro_ro: include IP-ul de redirecționare a serverului (HTTP_X_FORWARDED_FOR)

source: These settings are not recommended and are risky to enable, as these will block your access when you are using this on your local environment. The options are intended only for use with hosts like Cloudflare, or when the server IP is masked as 127.0.0.1 or ::1 (using HTTP proxy or a load balancer).
ro_ro: Aceste setări nu sunt recomandate și este riscant să le activezi deoarece îți vor bloca accesul când le folosești în mediul tău local. Opțiunile sunt destinate numai utilizării cu servicii de găzduire, cum ar fi Cloudflare, sau când IP-ul serverului este mascat ca 127.0.0.1 sau ::1 (folosind un proxy HTTP sau un echilibrator de încărcare).

source: Block specific IPs
ro_ro: Blochează anumite IP-uri

source: Allow login only for allowed IPs
ro_ro: Permite autentificarea numai de la IP-urile permise

source: Allow login only for allowed countries
ro_ro: Permite autentificarea numai din țările permise

source: Allow login only for allowed countries or allowed IPs
ro_ro: Permite autentificarea numai din țările sau de la IP-urile permise

source: Block login only for blocked IPs
ro_ro: Blochează autentificarea numai de la IP-urile blocate

source: Block login only for blocked countries
ro_ro: Blochează autentificarea numai din țările blocate

source: Block login only for blocked countries or blocked IPs
ro_ro: Blochează autentificarea numai din țările sau de la IP-urile blocate

source: Allow login only for allowed countries or allowed IPs, but not from blocked IPs
ro_ro: Permite autentificarea numai din țările sau de la IP-urile permise, nu și de la IP-urile blocate

source: Allow login only for allowed countries or allowed IPs, but not from blocked IPs or blocked countries
ro_ro: Permite autentificarea numai din țările sau de la IP-urile permise, nu și de la IP-urile sau din țările blocate

source: Block login only for blocked countries or blocked IPs, but not for allowed IPs
ro_ro: Blochează autentificarea numai din țările sau de la IP-urile blocate, nu și de la IP-urile permise

source: Block login only for blocked countries or blocked IPs, but not for allowed IPs or allowed countries
ro_ro: Blochează autentificarea numai din țările sau de la IP-urile blocate, nu și de la IP-urile sau din țările permise

source: Login IP & Country Restriction Settings
ro_ro: Setări Login IP & Country Restriction

source: Rule Type
ro_ro: Tip de regulă

source: IP Restriction
ro_ro: Restricție pentru IP

source: Country Restriction
ro_ro: Restricție pentru țară

source: Redirects
ro_ro: Redirecționări

source: Other Settings
ro_ro: Alte setări

source: No redirect
ro_ro: Nicio redirecționare

source: No redirects
ro_ro: Fără redirecționări

source: Use redirects
ro_ro: Folosește redirecționări

source: Yes, use redirects to the front page when the URLs are accessed by someone that has a restriction.
ro_ro: Da, folosește redirecționări la pagina din față când URL-urile sunt accesate de cineva care are o restricție.

source: Login & Registration native pages
ro_ro: Pagini native Autentificare și Înregistrare

source: Redirect login from %1$s to %2$s.
ro_ro: Redirecționează autentificarea de la %1$s la %2$s.

source: Redirect registration from %1$s to %2$s.
ro_ro: Redirecționează înregistrarea de la %1$s la %2$s.

source: The restriction to the pages configured above will apply if the login restriction is matched.
ro_ro: Restricția pentru paginile configurate mai sus se va aplica dacă se potrivește cu restricția pentru autentificare.

source: The following specified URLs
ro_ro: Următoarele URL-uri specificate

source: (separate the URLs with comma)
ro_ro: (separă URL-urile cu virgule)

source: Login Restriction Rules
ro_ro: Reguli pentru restricționarea autentificărilor

source: The login filter can be configured to work in a different way, depending on what type of rules to be assessed and in which order.
ro_ro: Filtrul de autentificare poate fi configurat să funcționeze într-un mod diferit, în funcție de ce tip de reguli sunt evaluate și în ce ordine.

source: Filter XML-RPC Authenticated Methods
ro_ro: Filtrează metodele XML-RPC autentificate

source: Default
ro_ro: Implicit

source: Disable all
ro_ro: Dezactivează tot

source: Disable only when matching a restriction rule
ro_ro: Dezactivează numai când se potrivește cu o regulă de restricție

source: The option above controls whether XML-RPC methods requiring authentication (such as for publishing purposes) are enabled and do not interfere with pingbacks or other custom endpoints that don't require authentication.
ro_ro: Opțiunea de mai sus controlează dacă metodele XML-RPC care necesită autentificare (ca cele cu scop de publicare) sunt activate și nu interferează cu pingback-urile sau alte puncte-finale personalizate care nu necesită autentificare.

source: You are using the free version.
ro_ro: Acum folosești versiunea gratuită.

source: Click the button to see more and get the <a class="pro-item button button-primary" href="%1$s" target="_blank">version</a> of the plugin!
ro_ro: Fă click pe buton pentru a vedea mai multe și pentru a cumpăra <a class="pro-item button button-primary" href="%1$s" target="_blank">versiunea <b>PRO</b></a> a acestui modul!

source: You are using the PRO version.
ro_ro: Acum folosești versiunea PRO.

source: It seems that you either did not input yet your license key, or that is not valid or has expired already.
ro_ro: Se pare că nu ai introdus cheia de licență, cheia nu este validă sau deja a expirat.

source: Click the button to get a valid license key for the <a class="pro-item button button-primary" href="%1$s" target="_blank">version</a> of the plugin!
ro_ro: Dă clic pe buton pentru a obține o cheie de licență validă pentru <a class="pro-item button button-primary" href="%1$s" target="_blank">versiunea</a> acestui modul!

source: This plugin allows you to restrict the login on your website, based on the custom rules you apply. This helps with tightening your website security and fights against dictionary bot attacks originating from other countries, by denying access.
ro_ro: Acest modul îți permite să restricționezi autentificarea pe site-ul tău pe baza unor reguli personalizate pe care le aplici. Te ajută să întărești securitatea pe site și, prin interzicerea accesului, luptă împotriva atacurilor clasice ale boțiilor care provin din alte țări.

source: The PRO version includes additional useful features
ro_ro: Versiunea PRO include funcționalități suplimentare utile

source: Additional Rule Types
ro_ro: Tipuri de reguli adiționale

source: Redirect Restricted Login
ro_ro: Redirecționează autentificările restricționate

source: Lockout duration
ro_ro: Durata blocării

source: Individual lockout
ro_ro: Blocare individuală

source: WooCommerce Integration
ro_ro: Integrare cu WooCommerce

source: Bypass the IP and country restriction for the specified roles
ro_ro: Ocolește restricția de IP și țară pentru rolurile specificate

source: Single IP Login Per User
ro_ro: Autentificare unică pe IP pentru utilizator

source: Simulate IP and Country
ro_ro: Simulare IP și țară

source: Temporarily disable all settings
ro_ro: Dezactivează temporar toate setările

source: For some reason the authentication for your account is restricted. Please contact the administrator.
ro_ro: Din anumite motive, autentificarea în contul tău este restricționată. Te rog să contactezi administratorul.

source: The settings were reset to default.
ro_ro: Setările au fost resetate la valorile implicite.

source: The settings were not imported.
ro_ro: Setările nu au fost importate.

source: The settings were imported.
ro_ro: Setările au fost importate.

source: Action not allowed.
ro_ro: Acțiunea nu este permisă.

source: Security Breach
ro_ro: Breșă de securitate

source: The settings were updated.
ro_ro: Setările au fost actualizate.

source: You currently enabled a simulation with IP %1$s and country code %2$s.
ro_ro: Momentan ai activat o simulare cu IP-ul %1$s și codul țării %2$s.

source: According to the current combination of IPs + country codes + rule type that is applied, the login is %s.
ro_ro: Conform combinației curente de IP-uri + coduri de țări + tip de regulă care s-a aplicat, autentificarea este %s.

source: allowed
ro_ro: permisă

source: blocked
ro_ro: blocată

source: The restriction will apply to your user as well! Please make sure you change the restriction to allow your own access.
ro_ro: Restricția se va aplica și pentru tine, ca utilizator! Te rog să te asiguri că modifici restricția ca să ai acces.

source: Based on the current setup all settings are temporarily disabled.
ro_ro: În funcție de inițializarea curentă, sunt dezactivate temporar toate setările.

source: There is no IP specified or you have * in the IPs list, meaning there is no IP filter to apply.
ro_ro: Nu ai specificat niciun IP sau ai * în lista cu IP-uri, asta înseamnă că nu se aplică niciun filtru pentru IP.

source: There is no country filter to apply.
ro_ro: Niciun filtru de aplicat pentru țară.

source: undefined
ro_ro: nedefinit

source: Forbidden!
ro_ro: Interzis!

source: Based on the current options there is no login restriction.
ro_ro: Pe baza opțiunilor curente, nu există nicio restricție la autentificare.

source: Based on the current options there is a login restriction, this is:
ro_ro: Pe baza opțiunilor curente există o restricție de autentificare, aceasta este:

source: %1$s for the %2$s IPs
ro_ro: %1$s pentru IP-urile %2$s

source: any
ro_ro: oricare

source: %1$s from the %2$s countries
ro_ro: %1$s din țările %2$s

source: Settings
ro_ro: Setări

source: Plugin URL
ro_ro: URL modul

source: A huge thanks in advance!
ro_ro: Multe mulțumiri în avans!

source: If you find the plugin useful and would like to support my work, please consider making a <a href="%s" target="_blank">donation</a>.
ro_ro: Dacă acest modul îți este folositor și ai dori să îmi sprijini munca, m-aș bucura dacă ai face o <a href="%s" target="_blank">donație</a>.

source: It would make me very happy if you would leave a %s rating.
ro_ro: M-aș bucura foarte mult dacă lași o evaluare de %s.

source: %1$s plugin was activated!
ro_ro: Modulul %1$s a fost activat!

source: You are using the free version. Get the <a href="%1$s" target="_blank"><b>PRO</b> version</a>.
ro_ro: Acum folosești versiunea gratuită. Cumpără <a href="%1$s" target="_blank">versiunea <b>PRO</b></a>.

source: Thank you for purchasing the <a href="%1$s" target="_blank"><b>PRO</b> version</a>!
ro_ro: Mulțumesc că ai cumpărat <a href="%1$s" target="_blank">versiunea <b>PRO</b></a>!

source: %5$sCheck out my other <a href="%1$s" target="_blank" rel="noreferrer">%2$s free plugins</a> on WordPress.org and the <a href="%3$s" target="_blank" rel="noreferrer">%4$s other extensions</a> available!
ro_ro: %5$sVezi și celelalte <a href="%1$s" target="_blank" rel="noreferrer">%2$s module gratuite</a> ale mele pe WordPress.org și <a href="%3$s" target="_blank" rel="noreferrer">%4$s extensiile premium</a> disponibile!

source: Dismiss this notice.
ro_ro: Respinge această notificare.

source: Redirect restricted login
ro_ro: Redirecționare autentificare restricționată

source: Redirect the visitor to the site's "Not Found" page.
ro_ro: Redirecționează vizitatorul la pagina "Nu s-a găsit".

source: Show "Forbiden Access" and the custom message.
ro_ro: Arată "Access Interzis" și mesajul personalizat.

source: When a user attempts to authenticate and the account is restricted by any of the rules, then the user will see a the forbid message.
ro_ro: Când un utilizator încearcă să se autentifice și contul este restricționat pe baza oricăreia dintre reguli, atunci utilizatorul va vedea un mesaj de interzis.

source: Restricted login message
ro_ro: Mesaj autentificare restricționată

source: Lokout for
ro_ro: Blocare pentru

source: minutes
ro_ro: minute

source: When a user attempts to authenticate and the restriction kicks in, the user will not be able to login in the next hour (the default duration is 60 minutes), but you can change the duration.
ro_ro: Când un utilizator încearcă să se autentifice și se declanșează restricționarea, utilizatorul nu va putea să se mai autentifice în următoarea oră (durata implicită este 60 de minute), dar poți modifica durata.

source: Allow customers countries.
ro_ro: Permite țările clienților.

source: With this setting, you can instruct Login IP & Country Restriction plugin to auto-adapt to WooCommerce new customers, so that their country to automatically be added to the list of allowed countries so that they are granted login access right away.
ro_ro: Cu această setare poți instrui modului Login IP & Country Restriction să se auto-ajusteze la clienții noi din WooCommerce, astfel încât țara lor să fie adăugată automat în lista de țări permise, ca să aibă imediat acces la autentificare.

source: Roles Without Restriction
ro_ro: Roluri fără restricții

source: You can select the user roles that will bypass the login restriction that you put in place (based on the country or IP).
ro_ro: Poți selecta rolurile de utilizatori pentru care se ocolește restricția de autentificare pe care ai făcut-o (bazată pe țară și IP).

source: This is useful for shops, where your customers order then authenticate from various countries that might not match the restrictions by IP or country, but you would still want to grant them access to their accounts.
ro_ro: Acest lucru este folositor pentru magazine, unde clienții comandă apoi se autentifică din diverse țări care este posibil să nu se regăsească în restricțiile după IP sau țară, dar ai vrea să le acorzi access la conturile lor.

source: Single IP login per user
ro_ro: Autentificare cu IP unic per utilizator

source: If this option is enabled, the users will be allowed only from the first IP they had when they first login. Don't worry, you can revert this option at any time, and also reset the IP for individual users.
ro_ro: Dacă activezi această opțiune, utilizatorilor li se va permite să se autentifice doar de la primul IP de la care s-au autentificat prima data. Nu te îngrijora, poți reveni oricând la setarea inițială.

source: Reset the IPs for all the users that logged in previously, to allow them to login from other IPs going further.
ro_ro: Resetează IP-urilor pentru toți utilizatorii care s-au autentificat deja, pentru a le permite autentificarea de la alte IP-uri mai departe.

source: Yes, allow for individual lockout.
ro_ro: Da, permite blocarea individuală a accesului.

source: If for various reasons, you need to temporarily disable the login for a specific user, you can enable this option, then edit the user account to enable the lockout. Don't worry, you can revert this option at any time.
ro_ro: Dacă, din diverse motive, ai nevoie să dezactivezi temporar autentificarea pentru un anumit utilizator, poți folosi această opțiune și apoi să modifici contul de utilizator blocându-i accesul. Nu te îngrijora, poți reveni oricând la setarea inițială.

source: See the list of users with login restriction
ro_ro: Vezi lista de utilizatori cu restricție la autentificare

source: Simulate Restriction
ro_ro: Simulare restricție

source: Simulate IP
ro_ro: Simulare IP

source: country
ro_ro: țară

source: Temporarily Disable
ro_ro: Dezactivare temporară

source: Yes, disable this temporarily.
ro_ro: Da, dezactivează temporar.

source: If for various reasons, you need to temporarily disable all restrictions and any other settings of this plugin, you can use this option, without losing the current settings.
ro_ro: Dacă din diverse motive ai nevoie să dezactivezi temporar toate restricțiile și toate celelalte setări ale acestui modul, poți folosi această opțiune fără a pierde setările curente.

source: Simulate the IP or country code you input by accessing the site with the following token.
ro_ro: Simulează IP-ul sau codul țării introduse, prin accesarea sitului cu token-ul următor.

source: Your license key is not valid. Please validate the license key and review one more time the pro settings, these might have been reset to defaults.
ro_ro: Cheia ta de licență nu este validă. Te rog să validezi cheia de licență și să verifici încă o dată setările pro, este posibil ca acestea să se reseteze.

source: Disable login for this account
ro_ro: Dezactivează autentificarea pentru acest cont

source: This is enabled from settings from this user's role
ro_ro: Opțiunea este activată din setări pentru rolul acestui utilizator

source: Bypass the single IP login for this user
ro_ro: Ocolește IP-ul unic la login pentru acest utilizator

source: Reset the IP for this user
ro_ro: Resetează IP-ului pentru acest utilizator

source: and
ro_ro: și

source: country code
ro_ro: cod țară

source: You are accessing the login feature with a %1$s. The simulation for %2$s is checked against the rest of the rules you setup.
ro_ro: Accesezi funcționalitatea de autentificare cu o %1$s. Simularea pentru %2$s se trece prin restul regulilor pe care le-ai setat.

source: restriction simulation
ro_ro: simulare de restricție

source: Forbidden
ro_ro: Interzis

source: Login is disabled
ro_ro: Autentificare dezactivată

source: Login is allowed
ro_ro: Autentificare permisă

source: not restricted to this IP
ro_ro: fără restricționare la acest IP

source: Last login
ro_ro: Ultima autentificare

source: Any rule
ro_ro: Orice regulă

source: With login restriction
ro_ro: Cu restricție de autentificare

source: Without login restriction
ro_ro: Fără restricție de autentificare

source: none
ro_ro: nimic

source: License Key
ro_ro: Cheie de licentă

source: Validate
ro_ro: Validează

source: Activate
ro_ro: Activează

source: Reset
ro_ro: Resetează

source: The license key expiration date is %s.
ro_ro: Data de expirare pentru cheia de licență este %s.
